export const aboutData = [
  'Я юрист в области гражданского права. Мой интерес к программированию появился в процессе работы и использования Excel. Я начал создавать различные алгоритмы и активно использовать ветви кода с помощью if...else. Это стало помогать в реальных задачах.',
  'Желание запускать написанный код на любом калькуляторе в любом месте, где есть интернет, привели меня к JavaScript. Начальные навыки я получил на курсах Яндекс Практикума, HTML Academy. С тех пор мой интерес к веб-разработке растет пропорционально навыкам. Я продолжаю развиваться, беря на себя новые задачи и изучая новые технологии.',
];
