import { ExpData } from '@/shared/lib/types';

export const expData: ExpData = [
  {
    title: 'Юр. центр Восстания 6 (Консультант нотариуса)',
    icon: 'v6',
    date: 'июль 2022 - июль 2025',
    text: [
      'Разработал программу на JavaSript для создания различных документов, в том числе договоров на недвижимость.',
      'Занимался подготовкой, составлением документов для нотариального оформления, используя эту программу.',
      'Реализовал следующий функционал на JavaSript: различные формы для документов, модальные окна, обработка форм по алгоритму для составления текста, сохранение, редактирование и удаление определенной формы локально на клиенте, вычисление метрик (сумм, стоимостей, количества и т.п.), копирование в буфер обмена текста или определенных пунктов документа.',
      'Сократил количество шаблонов с нескольких сотен до программы-конструктора.',
    ],
  },
  {
    title: 'Яндекс Практикум (Студент)',
    icon: 'yandex',
    date: 'октябрь 2021 - июль 2022',
    noMarker: [3],
    text: [
      'Успешно защитил проекты в рамках учебной программы Web-разработчик. Прошел код-ревью проектов.',
      'Приобрел опыт работы в команде с использованием Git.',
      '',
      'Реализовал задачи:',
      'Адаптивная верстка с использованием технологий Flex, Grid.',
      'Функционал работы с удаленным сервером через REST API.',
      'Функционал отслеживания событий и взаимодействия с пользователем.',
      'Функционал получения информации с формы, кастомную валидацию формы.',
      'Проект на ООП и сборку через WebPack.',
      'Изучил основы React, Redux и Typescript.',
    ],
  },
];
